pyocd/pyOCD/pyocd/debug/svd/data/nrf5340_application.svd
        <cluster>
          <dim>256</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>PERIPHID[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_PERIPHID</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: List capabilities and access permissions for the peripheral with ID n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000012</resetValue>
            <fields>
              <field>
                <name>SECUREMAPPING</name>
                <description>Define configuration capabilities for Arm TrustZone Cortex-M secure attribute</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>This peripheral is always accessible as a non-secure peripheral</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>This peripheral is always accessible as a secure peripheral</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UserSelectable</name>
                    <description>Non-secure or secure attribute for this peripheral is defined by the PERIPHID[n].PERM register</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Split</name>
                    <description>This peripheral implements the split security mechanism. Non-secure or secure attribute for this peripheral is defined by the PERIPHID[n].PERM register.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMA</name>
                <description>Indicates if the peripheral has DMA capabilities and if DMA transfer can be assigned to a different security attribute than the peripheral itself</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDMA</name>
                    <description>Peripheral has no DMA capability</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoSeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers always have the same security attribute as assigned to the peripheral</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers can have a different security attribute than the one assigned to the peripheral</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Peripheral security mapping</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Peripheral is mapped in secure peripheral address space</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>If SECUREMAPPING == UserSelectable: Peripheral is mapped in non-secure peripheral address space. If SECUREMAPPING == Split: Peripheral is mapped in non-secure and secure peripheral address space.</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMASEC</name>
                <description>Security attribution for the DMA transfer</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>DMA transfers initiated by this peripheral have the secure attribute set</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>DMA transfers initiated by this peripheral have the non-secure attribute set</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can't be changed until the next reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRESENT</name>
                <description>Indicate if a peripheral is present with ID n</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Peripheral is not present</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IsPresent</name>
                    <description>Peripheral is present</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
