pyocd/pyOCD/pyocd/debug/svd/data/nrf5340_application.svd
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to disable interrupt for event READY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOWN</name>
              <description>Write '1' to disable interrupt for event DOWN</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UP</name>
              <description>Write '1' to disable interrupt for event UP</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CROSS</name>
              <description>Write '1' to disable interrupt for event CROSS</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Compare result</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result of last compare. Decision point SAMPLE task.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Below</name>
                  <description>Input voltage is below the reference threshold (VIN+ &amp;lt; VIN-)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Above</name>
                  <description>Input voltage is above the reference threshold (VIN+ &amp;gt; VIN-)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable LPCOMP</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable LPCOMP</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSEL</name>
          <description>Input pin select</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSEL</name>
              <description>Analog pin select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogInput0</name>
                  <description>AIN0 selected as analog input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput1</name>
                  <description>AIN1 selected as analog input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput2</name>
                  <description>AIN2 selected as analog input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput3</name>
                  <description>AIN3 selected as analog input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput4</name>
                  <description>AIN4 selected as analog input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput5</name>
                  <description>AIN5 selected as analog input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput6</name>
                  <description>AIN6 selected as analog input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput7</name>
                  <description>AIN7 selected as analog input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REFSEL</name>
          <description>Reference select</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ref1_8Vdd</name>
                  <description>VDD * 1/8 selected as reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref2_8Vdd</name>
                  <description>VDD * 2/8 selected as reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref3_8Vdd</name>
                  <description>VDD * 3/8 selected as reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref4_8Vdd</name>
                  <description>VDD * 4/8 selected as reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref5_8Vdd</name>
                  <description>VDD * 5/8 selected as reference</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref6_8Vdd</name>
                  <description>VDD * 6/8 selected as reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref7_8Vdd</name>
                  <description>VDD * 7/8 selected as reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARef</name>
                  <description>External analog reference selected</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref1_16Vdd</name>
                  <description>VDD * 1/16 selected as reference</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref3_16Vdd</name>
                  <description>VDD * 3/16 selected as reference</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref5_16Vdd</name>
                  <description>VDD * 5/16 selected as reference</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref7_16Vdd</name>
                  <description>VDD * 7/16 selected as reference</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref9_16Vdd</name>
                  <description>VDD * 9/16 selected as reference</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref11_16Vdd</name>
                  <description>VDD * 11/16 selected as reference</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref13_16Vdd</name>
                  <description>VDD * 13/16 selected as reference</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref15_16Vdd</name>
                  <description>VDD * 15/16 selected as reference</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTREFSEL</name>
          <description>External reference select</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTREFSEL</name>
              <description>External analog reference select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogReference0</name>
                  <description>Use AIN0 as external analog reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference1</name>
                  <description>Use AIN1 as external analog reference</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANADETECT</name>
          <description>Analog detect configuration</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANADETECT</name>
              <description>Analog detect configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cross</name>
                  <description>Generate ANADETECT on crossing, both upward crossing and downward crossing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Up</name>
                  <description>Generate ANADETECT on upward crossing only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Down</name>
                  <description>Generate ANADETECT on downward crossing only</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HYST</name>
          <description>Comparator hysteresis enable</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator hysteresis disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator hysteresis enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
