pyocd/pyOCD/pyocd/debug/svd/data/nrf5340_application.svd
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x524</addressOffset>
          <register>
            <name>SCK</name>
            <description>Pin select for serial clock SCK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CSN</name>
            <description>Pin select for chip select signal CSN.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO0</name>
            <description>Pin select for serial data MOSI/IO0.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO1</name>
            <description>Pin select for serial data MISO/IO1.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO2</name>
            <description>Pin select for serial data WP/IO2.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IO3</name>
            <description>Pin select for serial data HOLD/IO3.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XIPOFFSET</name>
          <description>Address offset into the external memory for Execute in Place operation.</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>XIPOFFSET</name>
              <description>Address offset into the external memory for Execute in Place operation. Value must be a multiple of 4.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCONFIG0</name>
          <description>Interface configuration.</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>READOC</name>
              <description>Configure number of data lines and opcode used for reading.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FASTREAD</name>
                  <description>Single data line SPI. FAST_READ (opcode 0x0B).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2O</name>
                  <description>Dual data line SPI. READ2O (opcode 0x3B).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ2IO</name>
                  <description>Dual data line SPI. READ2IO (opcode 0xBB).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4O</name>
                  <description>Quad data line SPI. READ4O (opcode 0x6B).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ4IO</name>
                  <description>Quad data line SPI. READ4IO (opcode 0xEB).</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEOC</name>
              <description>Configure number of data lines and opcode used for writing.</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Single data line SPI. PP (opcode 0x02).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP2O</name>
                  <description>Dual data line SPI. PP2O (opcode 0xA2).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4O</name>
                  <description>Quad data line SPI. PP4O (opcode 0x32).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP4IO</name>
                  <description>Quad data line SPI. PP4IO (opcode 0x38).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRMODE</name>
              <description>Addressing mode.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24BIT</name>
                  <description>24-bit addressing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit addressing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPMENABLE</name>
              <description>Enable deep power-down mode (DPM) feature.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable DPM feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable DPM feature.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPSIZE</name>
              <description>Page size for commands PP, PP2O, PP4O and PP4IO.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256Bytes</name>
                  <description>256 bytes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512Bytes</name>
                  <description>512 bytes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XIPEN</name>
          <description>Enable Execute in Place operation.</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>XIPEN</name>
              <description>Enable XIP AHB Slave interface and access to XIP memory range</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable XIP interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable XIP interface</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>XIP_ENC</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_XIP_ENC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>KEY0</name>
            <description>Bits 31:0 of XIP AES KEY</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY0</name>
                <description>Bits 31:0 of XIP AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY1</name>
            <description>Bits 63:32 of XIP AES KEY</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY1</name>
                <description>Bits 63:32 of XIP AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY2</name>
            <description>Bits 95:64 of XIP AES KEY</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY2</name>
                <description>Bits 95:64 of XIP AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY3</name>
            <description>Bits 127:96 of XIP AES KEY</description>
            <addressOffset>0x00C</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY3</name>
                <description>Bits 127:96 of XIP AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE0</name>
            <description>Bits 31:0 of XIP NONCE</description>
            <addressOffset>0x010</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>NONCE0</name>
                <description>Bits 31:0 of XIP NONCE</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE1</name>
            <description>Bits 63:32 of XIP NONCE</description>
            <addressOffset>0x014</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>NONCE1</name>
                <description>Bits 63:32 of XIP NONCE</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE2</name>
            <description>Bits 95:64 of XIP NONCE</description>
            <addressOffset>0x018</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>NONCE2</name>
                <description>Bits 95:64 of XIP NONCE</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ENABLE</name>
            <description>Enable stream cipher for XIP</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable stream cipher for XIP</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable stream cipher for QSPI XIP</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable stream cipher for QSPI XIP</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA_ENC</name>
          <description>Unspecified</description>
          <headerStructName>QSPI_DMA_ENC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x580</addressOffset>
          <register>
            <name>KEY0</name>
            <description>Bits 31:0 of DMA AES KEY</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY0</name>
                <description>Bits 31:0 of DMA AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY1</name>
            <description>Bits 63:32 of DMA AES KEY</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY1</name>
                <description>Bits 63:32 of DMA AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY2</name>
            <description>Bits 95:64 of DMA AES KEY</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY2</name>
                <description>Bits 95:64 of DMA AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>KEY3</name>
            <description>Bits 127:96 of DMA AES KEY</description>
            <addressOffset>0x00C</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY3</name>
                <description>Bits 127:96 of DMA AES KEY</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE0</name>
            <description>Bits 31:0 of DMA NONCE</description>
            <addressOffset>0x010</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>NONCE0</name>
                <description>Bits 31:0 of DMA NONCE</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
